Catalogs/MRS_Меню.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>MRS_Меню</Name>
			<Comment>Иерархический справочник меню точек продаж с интеграцией Simphony</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.КассыККМ</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Ссылка на номенклатуру (для позиций меню)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПозиции</Name>
					<Comment>Уникальный номер позиции для Simphony (stringNumberId), 9 символов</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВМеню</Name>
					<Comment>Номер в меню Simphony (fileNum)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МажорнаяГруппа</Name>
					<Comment>Ссылка на мажорную группу Simphony</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.MRS_МажорнаяГруппа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассМеню</Name>
					<Comment>Ссылка на класс меню Simphony</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.MRS_КлассМеню</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СемейнаяГруппа</Name>
					<Comment>Ссылка на семейную группу Simphony (наследуется от родителя для позиций)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.MRS_СемейнаяГруппа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDСтруктурыSimphony</Name>
					<Comment>ID иерархической структуры Simphony (hierStrucId), всегда = 1</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Видимость</Name>
					<Comment>Видимость позиции в меню Simphony (isVisible)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/MRS_СтатусыСинхронизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>MRS_СтатусыСинхронизации</Name>
			<Comment>Статусы синхронизации позиций меню с Simphony</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создано</Name>
					<Comment>Позиция создана в 1С, но еще не синхронизирована</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОбработке</Name>
					<Comment>Запрос на синхронизацию отправлен</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Синхронизировано</Name>
					<Comment>Успешно синхронизировано с Simphony</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
					<Comment>Ошибка при синхронизации</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/MRS_Меню/Forms/ФормаСписка/Ext/Form/Module.bsl
// Форма списка справочника MRS_Меню
// Иерархический список позиций меню с отборами и командами синхронизации

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Установка начальных значений отборов
	УстановитьОтборыСписка();
	
	// Добавление вычисляемых полей статуса синхронизации
	ДобавитьПоляСтатусовВСписок();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборВладелецПриИзменении(Элемент)
	
	УстановитьОтборыСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСемейнаяГруппаПриИзменении(Элемент)
	
	УстановитьОтборыСписка();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьГруппу(Команда)
	
	// Проверка выбора владельца
	Если НЕ ЗначениеЗаполнено(ОтборВладелец) Тогда
		
		ПоказатьПредупреждение(, "Необходимо выбрать Кассу ККМ для создания группы меню");
		Возврат;
		
	КонецЕсли;
	
	// Открытие формы создания группы
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", 
		Новый Структура("Владелец,ЭтоГруппа", ОтборВладелец, Истина));
	
	ОткрытьФорму("Справочник.MRS_Меню.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СинхронизироватьВыбранные(Команда)
	
	// Получение выбранных строк
	ВыбранныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	Если ВыбранныеСтроки.Количество() = 0 Тогда
		
		ПоказатьПредупреждение(, "Необходимо выбрать позиции меню для синхронизации");
		Возврат;
		
	КонецЕсли;
	
	// Синхронизация выбранных позиций
	СинхронизироватьВыбранныеНаСервере(ВыбранныеСтроки);
	
	// Обновление списка
	Элементы.Список.Обновить();
	
	ПоказатьОповещениеПользователя("Синхронизация завершена", , 
		"Синхронизировано позиций: " + Формат(ВыбранныеСтроки.Количество(), "ЧГ="));
	
КонецПроцедуры

&НаКлиенте
Процедура МассоваяСинхронизация(Команда)
	
	// Открытие обработки массовой синхронизации
	ПараметрыФормы = Новый Структура;
	
	Если ЗначениеЗаполнено(ОтборВладелец) Тогда
		
		ПараметрыФормы.Вставить("Владелец", ОтборВладелец);
		
	КонецЕсли;
	
	ОткрытьФорму("Обработка.MRS_МассоваяСинхронизацияМеню.Форма", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОтборыСписка()
	
	// Получение динамического списка
	ДинамическийСписок = Список;
	
	// Очистка существующих отборов
	ДинамическийСписок.Отбор.Элементы.Очистить();
	
	// Установка отбора по владельцу
	Если ЗначениеЗаполнено(ОтборВладелец) Тогда
		
		ЭлементОтбора = ДинамическийСписок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = ОтборВладелец;
		ЭлементОтбора.Использование = Истина;
		
	КонецЕсли;
	
	// Установка отбора по семейной группе
	Если ЗначениеЗаполнено(ОтборСемейнаяГруппа) Тогда
		
		ЭлементОтбора = ДинамическийСписок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СемейнаяГруппа");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = ОтборСемейнаяГруппа;
		ЭлементОтбора.Использование = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПоляСтатусовВСписок()
	
	// Для отображения статуса синхронизации будет использоваться событие ПриПолученииДанных
	// или вычисляемое поле динамического списка через настройку компоновки данных
	
КонецПроцедуры

&НаСервере
Процедура СинхронизироватьВыбранныеНаСервере(Знач ВыбранныеСтроки)
	
	// Формирование массива ссылок на позиции меню
	МассивПозиций = Новый Массив;
	
	Для Каждого ВыбраннаяСтрока Из ВыбранныеСтроки Цикл
		
		// Проверка, что это не группа
		Если ТипЗнч(ВыбраннаяСтрока) = Тип("СправочникСсылка.MRS_Меню") Тогда
			
			ЭлементМеню = ВыбраннаяСтрока.ПолучитьОбъект();
			
			Если ЭлементМеню <> Неопределено И НЕ ЭлементМеню.ЭтоГруппа Тогда
				
				МассивПозиций.Добавить(ВыбраннаяСтрока);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Проверка наличия позиций для синхронизации
	Если МассивПозиций.Количество() = 0 Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выбранные элементы не являются позициями меню");
		Возврат;
		
	КонецЕсли;
	
	// Установка статуса "В обработке"
	MRS_ЛогированиеИнтеграцииСервер.УстановитьСтатусВОбработке(МассивПозиций);
	
	// Вызов процедуры синхронизации
	Попытка
		
		MRS_ИнтеграцияSimphonyСервер.СоздатьПозицииМенюПакетно(МассивПозиций, 1);
		
	Исключение
		
		// Обработка ошибки
		ТекстОшибки = ОписаниеОшибки();
		
		// Установка статуса "Ошибка" для всех позиций
		Для Каждого ПозицияМеню Из МассивПозиций Цикл
			
			MRS_ЛогированиеИнтеграцииСервер.ОбновитьСтатусСинхронизации(ПозицияМеню, Перечисления.MRS_СтатусыСинхронизации.Ошибка, ТекстОшибки);
			
		КонецЦикла;
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти
